Repository: turulomio/swapping_ebuilds
Catalog: locale/*.po
Languages: es

source: New Release:
es: Nueva versión:

source: * Change version and date in __init__.py
es: * Cambiar versión y fecha en __init__.py

source: * Edit Changelog in README
es: * Modificar el Changelog en README

source: * Make a new tag in github
es: * Hacer un nuevo tag en GitHub

source: * Create a new gentoo ebuild with the new version
es: * Crea un nuevo ebuild de Gentoo con la nueva versión

source: * Upload to portage repository
es: * Subelo al repositorio del portage

source: Uninstall command only works in Linux
es: El comando 'uninstall' solo funciona en Linux

source: You pressed 'Ctrl+C', exiting...
es: Se ha pulsado 'Ctrl+C', saliendo...

source: {} [{}] has {} reports with {} of swap variation average and {} of swap average. They took {}
es: {} [{}] tiene {} registros con {} de variación media de swap y {} de media de swap. Tardaron {}

source: There isn't log to list
es: No hay registros para listar

source: Problem parsing: {line}
es: Problema al parsear: {line}

source: This app logs swap information in /var/lib/swapping_ebuilds.txt compiling Gentoo packages. This allow you to change in package.env the number of processors used, to decrease swapping and improve ebuild time compilation
es: Esta aplicación registra información de la swap en /var/lib/swapping_ebuilds.txt al compilar paquetes de Gentoo. Esto te permite cambiar en package.env el número de procesadores a usar, para decrementar el swapping y mejorar el tiempo de compilación

source: Developed by Mariano Muñoz 2017-{}
es: Desarrollado por Mariano Muñoz 2017-{}

source: Parameters
es: Parámetros

source: Seconds between medition. Default is 10
es: Segundos entre mediciones. Por defecto es 10

source: Minutes of swapping required to highlight ebuilds with --analyze. Default is 15
es: Minutos de swapping requeridos para resaltar ebuilds con --analyze. Por defecto es 15

source: Number of consecutive logs with swapping required to highlight with --list. Default is 3
es: Número de registros consecutivos con swapping requeridos para resaltar con --list. Por defecto es 3

source: Shows in --list and --analyze only highlighted records
es: Muestra en --list y en --analyze sólo los registros resaltados

source: Analyze log
es: Analizar el registro

source: Generate log
es: Generar el registro

source: Clean log
es: Limpiar el registro

source: List log
es: Listar registros

source: --hl_analyze must be positive
es: --hl_analyze debe ser positivo

source: --hl_list must be greater than 1
es: --hl_list debe ser mayor que 1

source: Log cleaned
es: Registro limpiado

source: Log already cleaned
es: El registro ya ha sido limpiado

source: {datetime.now()} Ebuild hasn't been detected. Swap: {filesize.naturalsize(used)} (Variation: {filesize.naturalsize(diff)})
es: {datetime.now()} Ebuild no ha sido detectado. Swap: {filesize.naturalsize(used)} (Variación: {filesize.naturalsize(diff)})

source: No swapping detected
es: No se ha detectado swapping
